export default function AboutUsPanel() {
  return (
    <div className="flex flex-col gap-2">
      <p className="text-gray-8 max-md:text-sm">
        ما در بیلیتو مفتخریم که یکی از پیشروان در صنعت هواپیمایی هستیم و خدماتی
        بی‌نظیر را به مسافران عزیز ارائه می‌دهیم. با تیمی از کارشناسان حرفه‌ای
        در زمینه‌ی هواپیمایی، ما بهترین شرایط و تجربه را برای سفرهای شما فراهم
        می‌کنیم.
      </p>
      <h2 className="text-gray-8 text-xl font-bold">اهداف ما</h2>
      <p className="text-gray-7 max-md:text-sm">
        هدف اصلی ما در بیلیتو، ارائه‌ی خدماتی با کیفیت و استاندارد در سطح
        بین‌المللی است. با تمرکز بر رضایت مشتریان، ما سعی می‌کنیم تجربه‌ی سفر
        شما را به یک تجربه‌ی لاکچری و ناشناخته تبدیل کنیم. از لحظه‌ی رزرو تا
        رسیدن به مقصد، ما همراه شما خواهیم بود و اطمینان می‌دهیم که هر جزئیات
        سفر شما به بهترین شکل ممکن انجام شود.
      </p>
      <h2 className="text-gray-8 text-xl font-bold">خدمات ما</h2>
      <p className="text-gray-7 max-md:text-sm">
        در بیلیتو، ما مجموعه‌ای از خدمات شگفت‌انگیز را برای شما آماده کرده‌ایم.
        از رزرو آنلاین سریع و آسان، تا پروازهای راحت و امکانات لوکس در هواپیما،
        همه‌ی جزئیات سفر شما تحت نظر ماست. همچنین، با تیم پشتیبانی ما در دسترس
        شما هستیم تا در صورت بروز هرگونه مشکل یا سوال، به شما کمک کنیم.
      </p>
      <p className="text-gray-8 pt-6 max-md:text-sm">
        با تشکر از انتخاب شما برای سفر با بیلیتو. ما در انتظار خدمت‌رسانی به شما
        هستیم و امیدواریم که تجربه‌ی سفری فوق‌العاده را برای شما فراهم کنیم.
      </p>
    </div>
  );
}
