import {
  CreditCardIcon,
  NoteIcon,
  PlaneIcon,
  SearchIcon,
  TicketIcon,
  TickSquareIcon,
} from "../_components/icons";

export const buySteps = [
  {
    title: "جستجوی بلیط",
    description:
      "در بخش جستجو، نوع سفر (یکطرفه یا رفت و برگشت) و مبدأ و مقصد خود را وارد کنید، تاریخ سفر و کلاس پرواز را انتخاب کنید و تعداد مسافران را مشخص کنید.",
    Icon: SearchIcon,
  },
  {
    title: "انتخاب پرواز",
    description:
      "بر اساس اطلاعاتی که وارد کرده‌اید، نتایجی شامل لیست پروازها و قیمت‌ها نمایش داده می‌شود. می‌توانید پروازهای مختلف را بررسی کنید و بر اساس ترجیحات خود، یک پرواز را انتخاب کنید.",
    Icon: PlaneIcon,
  },
  {
    title: "انتخاب صندلی",
    description:
      "پس از انتخاب پرواز، شما باید صندلی یا صندلی‌های مورد نظر خود را انتخاب کنید.",
    Icon: TickSquareIcon,
  },
  {
    title: "اطلاعات مسافران",
    description:
      "در این مرحله باید اطلاعات مسافران را وارد کنید. این اطلاعات شامل نام و نام خانوادگی، جنسیت، تاریخ تولد و اطلاعات تماس می‌باشد.",
    Icon: NoteIcon,
  },
  {
    title: "تایید و پرداخت",
    description:
      "در این مرحله باید هزینه بلیط را پرداخت کنید. شما می‌توانید با کارت بانکی، که رمز پویا دارد، وارد درگاه پرداخت شده و پس از پرداخت موفق، بلیط شما تایید می‌شود و یک بلیط الکترونیکی به شما ارائه می‌شود.",
    Icon: CreditCardIcon,
  },
  {
    title: "دریافت بلیط",
    description:
      "پس از تایید خرید، بلیط را از وب‌سایت رزرو شده دریافت کنید و یا آن را چاپ کنید.",
    Icon: TicketIcon,
  },
];
